OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic16/libdev/pic18f97j94.c
__at(0x0EEA) __sfr ODCON2;
__at(0x0EEA) volatile __ODCON2bits_t ODCON2bits;

__at(0x0EEB) __sfr ODCON1;
__at(0x0EEB) volatile __ODCON1bits_t ODCON1bits;

__at(0x0EEC) __sfr MDCARL;
__at(0x0EEC) volatile __MDCARLbits_t MDCARLbits;

__at(0x0EED) __sfr MDCARH;
__at(0x0EED) volatile __MDCARHbits_t MDCARHbits;

__at(0x0EEE) __sfr MDSRC;
__at(0x0EEE) volatile __MDSRCbits_t MDSRCbits;

__at(0x0EEF) __sfr MDCON;
__at(0x0EEF) volatile __MDCONbits_t MDCONbits;

__at(0x0EF0) __sfr PMD4;
__at(0x0EF0) volatile __PMD4bits_t PMD4bits;

__at(0x0EF1) __sfr PMD3;
__at(0x0EF1) volatile __PMD3bits_t PMD3bits;

__at(0x0EF2) __sfr PMD2;
__at(0x0EF2) volatile __PMD2bits_t PMD2bits;

__at(0x0EF3) __sfr PMD1;
__at(0x0EF3) volatile __PMD1bits_t PMD1bits;

__at(0x0EF4) __sfr PMD0;
__at(0x0EF4) volatile __PMD0bits_t PMD0bits;

__at(0x0EF5) __sfr CTMUCON4;
__at(0x0EF5) volatile __CTMUCON4bits_t CTMUCON4bits;

__at(0x0EF6) __sfr CTMUCON3;
__at(0x0EF6) volatile __CTMUCON3bits_t CTMUCON3bits;

__at(0x0EF7) __sfr CTMUCON2;
__at(0x0EF7) volatile __CTMUCON2bits_t CTMUCON2bits;

__at(0x0EF8) __sfr CTMUCON1;
__at(0x0EF8) volatile __CTMUCON1bits_t CTMUCON1bits;

__at(0x0EF9) __sfr TXREG4;

__at(0x0EFA) __sfr RCREG4;

__at(0x0EFB) __sfr SPBRG4;
__at(0x0EFB) volatile __SPBRG4bits_t SPBRG4bits;

__at(0x0EFC) __sfr SPBRGH4;
__at(0x0EFC) volatile __SPBRGH4bits_t SPBRGH4bits;

__at(0x0EFD) __sfr BAUDCON4;
__at(0x0EFD) volatile __BAUDCON4bits_t BAUDCON4bits;

__at(0x0EFE) __sfr TXSTA4;
__at(0x0EFE) volatile __TXSTA4bits_t TXSTA4bits;

__at(0x0EFF) __sfr RCSTA4;
__at(0x0EFF) volatile __RCSTA4bits_t RCSTA4bits;

__at(0x0F00) __sfr DMACON2;
__at(0x0F00) volatile __DMACON2bits_t DMACON2bits;

__at(0x0F01) __sfr ANCFG;
__at(0x0F01) volatile __ANCFGbits_t ANCFGbits;

__at(0x0F02) __sfr SSP2ADD;

__at(0x0F03) __sfr SSP2BUF;

__at(0x0F04) __sfr T4CON;
__at(0x0F04) volatile __T4CONbits_t T4CONbits;

__at(0x0F05) __sfr PR4;

__at(0x0F06) __sfr TMR4;

__at(0x0F07) __sfr CCP7CON;
__at(0x0F07) volatile __CCP7CONbits_t CCP7CONbits;

__at(0x0F08) __sfr CCPR7;

__at(0x0F08) __sfr CCPR7L;

__at(0x0F09) __sfr CCPR7H;

__at(0x0F0A) __sfr CCP6CON;
__at(0x0F0A) volatile __CCP6CONbits_t CCP6CONbits;

__at(0x0F0B) __sfr CCPR6;

__at(0x0F0B) __sfr CCPR6L;

__at(0x0F0C) __sfr CCPR6H;

__at(0x0F0D) __sfr CCP5CON;
__at(0x0F0D) volatile __CCP5CONbits_t CCP5CONbits;

__at(0x0F0E) __sfr CCPR5;

__at(0x0F0E) __sfr CCPR5L;

__at(0x0F0F) __sfr CCPR5H;

__at(0x0F10) __sfr CCP4CON;
__at(0x0F10) volatile __CCP4CONbits_t CCP4CONbits;

__at(0x0F11) __sfr CCPR4;

__at(0x0F11) __sfr CCPR4L;

__at(0x0F12) __sfr CCPR4H;

__at(0x0F13) __sfr T5GCON;
__at(0x0F13) volatile __T5GCONbits_t T5GCONbits;

__at(0x0F14) __sfr T5CON;
__at(0x0F14) volatile __T5CONbits_t T5CONbits;

__at(0x0F15) __sfr TMR5;

__at(0x0F15) __sfr TMR5L;

__at(0x0F16) __sfr TMR5H;

__at(0x0F17) __sfr SSP2MSK;
__at(0x0F17) volatile __SSP2MSKbits_t SSP2MSKbits;

__at(0x0F18) __sfr SSP2CON2;
__at(0x0F18) volatile __SSP2CON2bits_t SSP2CON2bits;

__at(0x0F19) __sfr SSP2CON1;
__at(0x0F19) volatile __SSP2CON1bits_t SSP2CON1bits;

__at(0x0F1A) __sfr SSP2STAT;
__at(0x0F1A) volatile __SSP2STATbits_t SSP2STATbits;

__at(0x0F1B) __sfr PSTR3CON;
__at(0x0F1B) volatile __PSTR3CONbits_t PSTR3CONbits;

__at(0x0F1C) __sfr PSTR2CON;
__at(0x0F1C) volatile __PSTR2CONbits_t PSTR2CONbits;

__at(0x0F1D) __sfr TXREG2;

__at(0x0F1E) __sfr RCREG2;

__at(0x0F1F) __sfr SPBRG2;
__at(0x0F1F) volatile __SPBRG2bits_t SPBRG2bits;

__at(0x0F20) __sfr SPBRGH2;
__at(0x0F20) volatile __SPBRGH2bits_t SPBRGH2bits;

__at(0x0F21) __sfr DSGPR3;

__at(0x0F22) __sfr DSGPR2;

__at(0x0F23) __sfr DSGPR1;

__at(0x0F24) __sfr DSGPR0;

__at(0x0F25) __sfr DSWAKEH;
__at(0x0F25) volatile __DSWAKEHbits_t DSWAKEHbits;

__at(0x0F26) __sfr DSWAKEL;
__at(0x0F26) volatile __DSWAKELbits_t DSWAKELbits;

__at(0x0F27) __sfr DSCONH;
__at(0x0F27) volatile __DSCONHbits_t DSCONHbits;

__at(0x0F28) __sfr DSCONL;
__at(0x0F28) volatile __DSCONLbits_t DSCONLbits;

__at(0x0F29) __sfr TXREG3;

__at(0x0F2A) __sfr RCREG3;

__at(0x0F2B) __sfr SPBRG3;
__at(0x0F2B) volatile __SPBRG3bits_t SPBRG3bits;

__at(0x0F2C) __sfr SPBRGH3;
__at(0x0F2C) volatile __SPBRGH3bits_t SPBRGH3bits;

__at(0x0F2D) __sfr BAUDCON3;
__at(0x0F2D) volatile __BAUDCON3bits_t BAUDCON3bits;

__at(0x0F2E) __sfr TXSTA3;
__at(0x0F2E) volatile __TXSTA3bits_t TXSTA3bits;

__at(0x0F2F) __sfr RCSTA3;
__at(0x0F2F) volatile __RCSTA3bits_t RCSTA3bits;

__at(0x0F30) __sfr SPBRGH;
__at(0x0F30) volatile __SPBRGHbits_t SPBRGHbits;

__at(0x0F30) __sfr SPBRGH1;
__at(0x0F30) volatile __SPBRGH1bits_t SPBRGH1bits;

__at(0x0F31) __sfr BAUDCON2;
__at(0x0F31) volatile __BAUDCON2bits_t BAUDCON2bits;

__at(0x0F32) __sfr TXSTA2;
__at(0x0F32) volatile __TXSTA2bits_t TXSTA2bits;

__at(0x0F33) __sfr RCSTA2;
__at(0x0F33) volatile __RCSTA2bits_t RCSTA2bits;

__at(0x0F34) __sfr CCPTMRS2;
__at(0x0F34) volatile __CCPTMRS2bits_t CCPTMRS2bits;

__at(0x0F35) __sfr CCPTMRS1;
__at(0x0F35) volatile __CCPTMRS1bits_t CCPTMRS1bits;

__at(0x0F36) __sfr CCPTMRS0;
__at(0x0F36) volatile __CCPTMRS0bits_t CCPTMRS0bits;

__at(0x0F37) __sfr CM3CON;
__at(0x0F37) volatile __CM3CONbits_t CM3CONbits;

__at(0x0F38) __sfr CM2CON;
__at(0x0F38) volatile __CM2CONbits_t CM2CONbits;

__at(0x0F39) __sfr SSP2CON3;
__at(0x0F39) volatile __SSP2CON3bits_t SSP2CON3bits;

__at(0x0F3A) __sfr T8CON;
__at(0x0F3A) volatile __T8CONbits_t T8CONbits;

__at(0x0F3B) __sfr PR8;

__at(0x0F3C) __sfr TMR8;

__at(0x0F3D) __sfr T6CON;
__at(0x0F3D) volatile __T6CONbits_t T6CONbits;

__at(0x0F3E) __sfr PR6;

__at(0x0F3F) __sfr TMR6;

__at(0x0F40) __sfr CCP10CON;
__at(0x0F40) volatile __CCP10CONbits_t CCP10CONbits;

__at(0x0F41) __sfr CCPR10;

__at(0x0F41) __sfr CCPR10L;

__at(0x0F42) __sfr CCPR10H;

__at(0x0F43) __sfr CCP9CON;
__at(0x0F43) volatile __CCP9CONbits_t CCP9CONbits;

__at(0x0F44) __sfr CCPR9;

__at(0x0F44) __sfr CCPR9L;

__at(0x0F45) __sfr CCPR9H;

__at(0x0F46) __sfr CCP8CON;
__at(0x0F46) volatile __CCP8CONbits_t CCP8CONbits;

__at(0x0F47) __sfr CCPR8;

__at(0x0F47) __sfr CCPR8L;

__at(0x0F48) __sfr CCPR8H;

__at(0x0F49) __sfr CCP3CON;
__at(0x0F49) volatile __CCP3CONbits_t CCP3CONbits;

